zxf1023818103/bouffalo_sdk/examples/boot2_isp/port/bl606p/bflb_port_boot2.c
        left_flag = dqs_win_min;
        right_flag = dqs_win_max;
        c_val = ((left_flag + right_flag) >> 1);

        g_efuse_cfg.psram_dqs_cfg = (((left_flag << 0x4) | (right_flag)) & (0xff));

        BOOT2_MSG("c ef:0x%x\r\n", g_efuse_cfg.psram_dqs_cfg);
        *psram_dqs_win_num = right_flag - left_flag;
        if (((*psram_dqs_win_num) <= 4) || ((*psram_dqs_win_num) > 0xf)) {
            return ERROR;
        }
        psram_id = hal_boot2_psram_winbond_init_dqs(PSRAM_WINBOND_BURST_LENGTH_64_BYTES, 0, PSRAM_WINBOND_6_CLOCKS_LATENCY, dqs_val[c_val]);
        if ((psram_id != HAL_BOOT2_PSRAM_ID1_WINBOND_4MB) && (psram_id != HAL_BOOT2_PSRAM_ID2_WINBOND_16MB) && (psram_id != HAL_BOOT2_PSRAM_ID3_WINBOND_32MB)) {
            return ERROR;
        }
        /* to do write efuse psram dqs delay */
        if (!(before_ef & 0x1fff)) {
            bflb_ef_ctrl_write_common_trim(NULL,"psram",g_efuse_cfg.psram_dqs_cfg,1);
        }
    }
    return psram_id;
}


/****************************************************************************/ /**
 * @brief  trim dcdc and ldo
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void hal_boot2_efuse_trim(void)
{
    uint32_t tmpVal = 0;

    bflb_ef_ctrl_com_trim_t trim = {0};
    bflb_ef_ctrl_read_common_trim(NULL, "dcdc11", &trim, 1);
    if (trim.en) {
        if(trim.parity == bflb_ef_ctrl_get_trim_parity(trim.value,trim.len)){
            tmpVal = BL_RD_REG(AON_BASE, AON_DCDC_TOP_0);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AON_DCDC11_VOUT_TRIM_AON, trim.value);
            BL_WR_REG(AON_BASE, AON_DCDC_TOP_0, tmpVal);
        }
    }

    bflb_ef_ctrl_read_common_trim(NULL, "dcdc18", &trim, 1);
    if (trim.en) {
        if(trim.parity == bflb_ef_ctrl_get_trim_parity(trim.value,trim.len)){
            tmpVal = BL_RD_REG(AON_BASE, AON_DCDC18_TOP_0);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AON_DCDC18_VOUT_TRIM_AON, trim.value);
            BL_WR_REG(AON_BASE, AON_DCDC18_TOP_0, tmpVal);
        }
    }

    bflb_ef_ctrl_read_common_trim(NULL, "ldo28cis", &trim, 1);
    if (trim.en) {
        if(trim.parity == bflb_ef_ctrl_get_trim_parity(trim.value,trim.len)){
            tmpVal = BL_RD_REG(GLB_BASE, GLB_LDO28CIS);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_LDO28CIS_VOUT_TRIM, trim.value);
            BL_WR_REG(GLB_BASE, GLB_LDO28CIS, tmpVal);
        }
    }

    bflb_ef_ctrl_read_common_trim(NULL, "ldo15cis", &trim, 1);
    if (trim.en) {
        if(trim.parity == bflb_ef_ctrl_get_trim_parity(trim.value,trim.len)){
            tmpVal = BL_RD_REG(GLB_BASE, GLB_LDO15CIS);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_LDO15CIS_VOUT_TRIM, trim.value);
            BL_WR_REG(GLB_BASE, GLB_LDO15CIS, tmpVal);
        }
    }

    bflb_ef_ctrl_read_common_trim(NULL, "ldo18flash", &trim, 1);
    if (trim.en) {
        if(trim.parity == bflb_ef_ctrl_get_trim_parity(trim.value,trim.len)){
            tmpVal = BL_RD_REG(GLB_BASE, GLB_LDO18FLASH);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_LDO18FLASH_VOUT_TRIM, trim.value);
        BL_WR_REG(GLB_BASE, GLB_LDO18FLASH, tmpVal);
        }
    }

    bflb_ef_ctrl_read_common_trim(NULL, "usb20", &trim, 1);
    if (trim.en) {
        if(trim.parity == bflb_ef_ctrl_get_trim_parity(trim.value,trim.len)){
            tmpVal = BL_RD_REG(AON_BASE, AON_PSW_IRRCV);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AON_USB20_RCAL_CODE_AON, trim.value);
            BL_WR_REG(AON_BASE, AON_PSW_IRRCV, tmpVal);
        }
    }

    bflb_ef_ctrl_read_common_trim(NULL, "ldo18io", &trim, 1);
    if (trim.en) {
        if(trim.parity == bflb_ef_ctrl_get_trim_parity(trim.value,trim.len)){
            tmpVal = BL_RD_REG(AON_BASE, AON_LDO18IO);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AON_LDO18IO_VOUT_SEL_AON, 0x2);
            BL_WR_REG(AON_BASE, AON_LDO18IO, tmpVal);
        }
    }


}



/****************************************************************************/ /**
 * @brief  hal_boot2_custom
 *
 * @param  custom_param
 *
 * @return 0
 *
*******************************************************************************/
uint32_t hal_boot2_custom(void *custom_param)
{
    int32_t psram_dqs_win_num = 0;

    hal_boot2_efuse_trim();

    /* for pds wakeup clock related to RF */
    GLB_AHB_MCU_Software_Reset(GLB_AHB_MCU_SW_PDS);
    PDS_Power_On_MM_System();

    /* psram calibration */
    uint32_t ret = 0;
    if ((g_efuse_cfg.dev_info.psram_info) != 0) {
        hal_boot2_init_psram_gpio();
        /* ToDo: if WIFIPLL_320m not work */
        GLB_PLL_CGEN_Clock_UnGate(GLB_PLL_CGEN_EMI_WIFIPLL_320M);
        GLB_PLL_CGEN_Clock_UnGate(GLB_PLL_CGEN_EMI_CPUPLL_400M);
        GLB_PLL_CGEN_Clock_UnGate(GLB_PLL_CGEN_EMI_AUPLL_DIV1);
        //GLB_PER_Clock_UnGate(GLB_AHB_CLOCK_PSRAM0_CTRL | GLB_AHB_CLOCK_PSRAM1_CTRL);
        GLB_PSRAM_PER_Clock_UnGate();
        GLB_Set_PSram_CLK(1, ENABLE, GLB_PSRAM_EMI_AUPLL_DIV1, 1);

        hal_boot2_psram_winbond_init_dqs(PSRAM_WINBOND_BURST_LENGTH_64_BYTES, 0, PSRAM_WINBOND_6_CLOCKS_LATENCY, 0xffc0);
        Tzc_Sec_PSRAMB_Access_Release();
        ret = hal_boot2_x8_psram_calibration(&psram_dqs_win_num);
        if (ret == ERROR) {
            while (1) {
                BOOT2_MSG("psram:%d\r\n", (int)psram_dqs_win_num);
                arch_delay_ms(500);
            }
        }
        BOOT2_MSG("psram:%d \r\n", (int)psram_dqs_win_num);

        /* Flush i-cache in case branch prediction logic is wrong when
       psram is not inited by hal_boot2_custom but cpu has already prefetch psram */
        __ISB();
    }
    return ret;
}

/****************************************************************************/ /**
 * @brief  hal_boot2_read_secure_boot
 *
 * @param  aes
 *
 * @return None
 *
*******************************************************************************/
void hal_boot2_read_secure_boot(uint8_t aes[HAL_BOOT2_CPU_GROUP_MAX])
{
    uint32_t tmpval = 0;
    bflb_ef_ctrl_read_direct(NULL, EF_DATA_0_EF_CFG_0_OFFSET, &tmpval, 1, 1);
    tmpval &= EF_DATA_0_EF_SF_AES_MODE_MSK;
    tmpval = tmpval >> EF_DATA_0_EF_SF_AES_MODE_POS;

    aes[1] = aes[0] = tmpval & 0xff;
}

/****************************************************************************/ /**
 * @brief  hal_boot2_get_efuse_cfg
 *
 * @param  efuse_cfg
 *
 * @return None
 *
*******************************************************************************/
void hal_boot2_get_efuse_cfg(boot2_efuse_hw_config *efuse_cfg)
{
    uint32_t i = 0;
    struct boot_efuse_sw_cfg0_t sw_cfg0;

    /* get hw cfg (signature and aes type) */
    hal_boot2_read_secure_boot(efuse_cfg->encrypted);


    for (i = 0; i < HAL_BOOT2_CPU_GROUP_MAX; i++) {
        if (efuse_cfg->encrypted[i] == EF_CTRL_SF_AES_192) {
            efuse_cfg->encrypted[i] = SF_CTRL_AES_192BITS + 1;
        } else if (efuse_cfg->encrypted[i] == EF_CTRL_SF_AES_256) {
            efuse_cfg->encrypted[i] = SF_CTRL_AES_256BITS + 1;
        }
    }

